#+Title: Karaf Usage
#+Subtitle:

* webconsole
  https://karaf.apache.org/manual/latest/webconsole
   #+NAME:                   
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      ./
   #+END_SRC

   #+RESULTS: 
   #+begin_example

   [wagner@Unknown fzl_karaf]$ total 64
   drwxrwxrwx. 3 wagner wagner 4096 ago  6 16:17 container_config_folder
   drwxrwxr-x. 2 wagner wagner 4096 ago  6 15:22 container_shared_folder
   -rwxrwxrwx. 1 wagner wagner  168 set 18  2018 docker-build-behind-proxy.sh
   -rwxrwxrwx. 1 wagner wagner   61 ago  6 22:14 docker-build.sh
   -rwxrwxr-x. 1 wagner wagner   84 jun 18 21:20 docker-exec-karaf-client-log-display.sh
   -rwxrwxr-x. 1 wagner wagner   74 ago  6 22:21 docker-exec-karaf-client-prompt.sh
   -rwxrwxrwx. 1 wagner wagner 1778 ago  6 20:42 Dockerfile
   -rwxrwxrwx. 1 wagner wagner  962 ago  6 21:44 docker-run.sh
   -rwxrwxrwx. 1 wagner wagner   72 set 18  2018 docker-start.sh
   drwxrwxr-x. 3 wagner wagner 4096 ago  6 15:33 downloads
   drwxr-xr-x. 2 wagner wagner 4096 ago  6 15:22 fzlbpms
   -rw-rw-r--. 1 wagner wagner   55 jun 18 21:28 index.org
   -rwxrwxr-x. 1 wagner wagner  184 jun 18 21:35 install-howtio.sh
   -rw-rw-r--. 1 wagner wagner  172 ago  6 22:41 karaf_usage.org
   drwxrwxrwx. 2 wagner wagner 4096 ago  6 15:22 scripts
   -rwxrwxrwx. 1 wagner wagner   91 set 18  2018 tail-f-catalina-out.sh
   #+end_example
